# vsoSetInCurtainWall

## Description
Used during event 52 to retrun whether an object is aCurtain Wall object

```pascal
PROCEDURE vsoSetInCurtainWall(inCurtainWall : BOOLEAN);
```

```python
def vs.vsoSetInCurtainWall(inCurtainWall):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inCurtainWall|BOOLEAN|   |

## Version
Availability: from Vectorworks 2015

## Category
* Object Events